---
type: ViewSheetSet
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ViewSheetSet

`Autodesk.Revit.DB.ViewSheetSet` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsAutomatic | — | `public virtual bool IsAutomatic { get ; set ; }` |
| Property | Name | — | `public override string Name { get ; set ; }` |
| Property | OrderedViewList | — | `public virtual IReadOnlyList < View > OrderedViewList { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SheetOrganizationId | — | `public virtual ElementId SheetOrganizationId { get ; set ; }` |
| Property | ViewOrganizationId | — | `public virtual ElementId ViewOrganizationId { get ; set ; }` |
| Property | Views | — | `public virtual ViewSet Views { get ; set ; }` |